Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum
Object difference types.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum.Undefined
Undefined object difference.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum.PartPositionX
Part position X difference.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum.PartPositionYZ
Part position YZ difference.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum.PartPositionXYZ
Part position XYZ difference.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum.PartRotation
Part rotation difference.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum.PartProfile
Part profile difference.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum.PartMaterial
Part material difference.